rails_app/app/controllers/api/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
    def index
      @posts = Post.order(created_at: :desc)